<a href="https://colab.research.google.com/github/tanpharamut/KKU_data_mining/blob/master/Project_.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import numpy as np
import pandas as pd

In [9]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [10]:
path = '/content/drive/My Drive/DWDM_material'

In [11]:
import os

In [12]:
RM = os.path.join(path,'Recommendation System.csv')

In [13]:
RM_Table = pd.read_csv(RM)

In [14]:
RM_Table

          0    50  5  881250949
0         0   172  5  881250949
1         0   133  1  881250949
2       196   242  3  881250949
3       186   302  3  891717742
4        22   377  1  878887116
...     ...   ... ..        ...
99997   880   476  3  880175444
99998   716   204  5  879795543
99999   276  1090  1  874795795
100000   13   225  2  882399156
100001   12   203  3  879959583

[100002 rows x 4 columns]

In [15]:
RM_Table .columns = (['user_id','item_id',"rating","timestamp"])

In [16]:
RM_Table.head()

   user_id  item_id  rating  timestamp
0        0      172       5  881250949
1        0      133       1  881250949
2      196      242       3  881250949
3      186      302       3  891717742
4       22      377       1  878887116

In [17]:
Movie = os.path.join(path,'Movie_Id_Titles')

In [18]:
Movie_Table = pd.read_csv(Movie)
Movie_Table

      item_id                                      title
0           1                           Toy Story (1995)
1           2                           GoldenEye (1995)
2           3                          Four Rooms (1995)
3           4                          Get Shorty (1995)
4           5                             Copycat (1995)
...       ...                                        ...
1677     1678                          Mat' i syn (1997)
1678     1679                           B. Monkey (1998)
1679     1680                       Sliding Doors (1998)
1680     1681                        You So Crazy (1994)
1681     1682  Scream of Stone (Schrei aus Stein) (1991)

[1682 rows x 2 columns]

In [19]:
df = pd.merge(RM_Table,Movie_Table,on='item_id')
df

        user_id  ...                                              title
0             0  ...                    Empire Strikes Back, The (1980)
1           213  ...                    Empire Strikes Back, The (1980)
2            92  ...                    Empire Strikes Back, The (1980)
3            77  ...                    Empire Strikes Back, The (1980)
4           194  ...                    Empire Strikes Back, The (1980)
...         ...  ...                                                ...
99997       840  ...                                  Mamma Roma (1962)
99998       655  ...                             Eighth Day, The (1996)
99999       655  ...                                  Girls Town (1996)
100000      655  ...  Silence of the Palace, The (Saimt el Qusur) (1...
100001      655  ...                                    Dadetown (1995)

[100002 rows x 5 columns]

In [20]:
df.sort_values('item_id').head()

      user_id  item_id  rating  timestamp             title
3937      308        1       4  887736532  Toy Story (1995)
4247      893        1       5  874827725  Toy Story (1995)
4246      336        1       3  877759342  Toy Story (1995)
4245      303        1       5  879466966  Toy Story (1995)
4244      886        1       4  876031433  Toy Story (1995)

In [21]:
df.isnull().any()

user_id      False
item_id      False
rating       False
timestamp    False
title        False
dtype: bool

In [27]:
asso = df.groupby('user_id')['title'].apply(list)
asso

user_id
0      [Empire Strikes Back, The (1980), Gone with th...
1      [Empire Strikes Back, The (1980), Gone with th...
2      [Kolya (1996), L.A. Confidential (1997), Men i...
3      [L.A. Confidential (1997), Jackie Brown (1997)...
4      [Cop Land (1997), Scream (1996), Liar Liar (19...
                             ...
939    [Men in Black (1997), Star Trek: First Contact...
940    [Empire Strikes Back, The (1980), L.A. Confide...
941    [Men in Black (1997), Star Trek: First Contact...
942    [Empire Strikes Back, The (1980), Hunt for Red...
943    [Empire Strikes Back, The (1980), Legends of t...
Name: title, Length: 944, dtype: object

In [28]:
!pip install apyori

Requirement already satisfied: apyori in /usr/local/lib/python3.6/dist-packages (1.1.2)

In [29]:
from apyori import apriori

In [30]:
list(apriori(asso,min_support=0.3,min_confidence=0.99))

[RelationRecord(items=frozenset({'Star Wars (1977)', 'Return of the Jedi (1983)', 'Empire Strikes Back, The (1980)'}), support=0.3336864406779661, ordered_statistics=[OrderedStatistic(items_base=frozenset({'Return of the Jedi (1983)', 'Empire Strikes Back, The (1980)'}), items_add=frozenset({'Star Wars (1977)'}), confidence=0.9936908517350158, lift=1.6089951355709349)]),
 RelationRecord(items=frozenset({'Star Wars (1977)', 'Return of the Jedi (1983)', 'Empire Strikes Back, The (1980)', 'Raiders of the Lost Ark (1981)'}), support=0.3114406779661017, ordered_statistics=[OrderedStatistic(items_base=frozenset({'Return of the Jedi (1983)', 'Empire Strikes Back, The (1980)', 'Raiders of the Lost Ark (1981)'}), items_add=frozenset({'Star Wars (1977)'}), confidence=0.9966101694915255, lift=1.6137221269296742)])]